app/Services/RegistroActividadesServices.php

    public function crearEvidencia($data, InstructorFichaCaracterizacion $caracterizacion)
    {
        $caracterizacion = $this->fichaCaracterizacionRepository->getFichaCaracterizacion($caracterizacion->ficha_id);
        $programaFormacion = $caracterizacion->programaFormacion;
        $competenciaActual = $programaFormacion->competenciaActual();
        $rapActual = $competenciaActual->rapActual();
        $guiaAprendizaje = $rapActual->guiasAprendizaje->first();

        $evidenciaId = Evidencias::create($data);

        $dataEvidenciaGuia = [
            'evidencia_id' => $evidenciaId->id,
            'guia_aprendizaje_id' => $guiaAprendizaje->id,
            'user_create_id' => $data['user_create_id'],
            'user_edit_id' => $data['user_edit_id']
        ];

        EvidenciaGuiaAprendizaje::create($dataEvidenciaGuia);
---
insert into `evidencias` (`codigo`, `nombre`, `fecha_evidencia`, `id_estado`, `user_create_id`, `user_edit_id`, `updated_at`, `created_at`) values ('EV-2', 'hgsdfsdgfsdfsa', '2025-07-30', 1, 3, 3, '2025-07-27 04:50:27', '2025-07-27 04:50:27')
insert into `evidencia_guia_aprendizaje` (`evidencia_id`, `guia_aprendizaje_id`, `user_create_id`, `user_edit_id`, `updated_at`, `created_at`) values (5, 15, 3, 3, '2025-07-27 04:50:27', '2025-07-27 04:50:27')