app/Models/InstructorFichaCaracterizacion.php

select * from `instructor_ficha_dias` where `instructor_ficha_dias`.`instructor_ficha_id` = 1 and `instructor_ficha_dias`.`instructor_ficha_id` is not null order by `dia_id` asc
---
    public function obtenerProximaClase()
    {
        $horaActual = now();
        $diaActual = $horaActual->dayOfWeek; // 0 = Domingo, 1 = Lunes, etc.

        // Mapeo de días: 0=Domingo->18, 1=Lunes->12, 2=Martes->13, etc.
        $diaIdActual = ($diaActual == 0) ? 18 : $diaActual + 11;

        // Obtener todos los días de formación ordenados por día
        $diasFormacion = $this->instructorFichaDias()
            ->orderBy('dia_id')
            ->get();