app/Repositories/EvidenciasRepository.php

select * from `evidencias` where exists (select * from `guia_aprendizajes` inner join `evidencia_guia_aprendizaje` on `guia_aprendizajes`.`id` = `evidencia_guia_aprendizaje`.`guia_aprendizaje_id` where `evidencias`.`id` = `evidencia_guia_aprendizaje`.`evidencia_id` and `guia_aprendizajes`.`id` = 15) order by `created_at` desc limit 1
---
    public function getUltimaEvidencia($idGuiaAprendizaje)
    {
        return Evidencias::whereHas('guiasAprendizaje', function ($query) use ($idGuiaAprendizaje) {
            $query->where('guia_aprendizajes.id', $idGuiaAprendizaje);
        })->latest()->first();