app/Repositories/InstructorRepository.php

select * from `instructors` where `persona_id` = 3 limit 1
---
    public function getInstructor($personaId)
    {
        return Instructor::where('persona_id', $personaId)->first();