app/Repositories/ParametroRepository.php

select * from `parametros` where exists (select * from `temas` inner join `parametros_temas` on `temas`.`id` = `parametros_temas`.`tema_id` where `parametros`.`id` = `parametros_temas`.`parametro_id` and `tema_id` = 4)
---
    public function getDiasFormacion()
    {
        return Parametro::whereHas('temas', function($query) {
            $query->where('tema_id', 4);
        })->get()->toArray();